generate_Data/generate_data_3d/simulation_data_test/2/system/blockMeshDict_plate
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  5                                      |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (1 -0.05 0.05)
    (0 0.012756364284264488 0.05)
    (0.18603262121057995 0.012756364284264488 0.05)
    (0.18986284342617482 0.015970302332697184 0.05)
    (0 0.015970302332697184 0.05)
    (0 0.05 0.05)
    (0.18986284342617482 0.05 0.05)
    (1 0.05 0.05)
    (1 0.015970302332697184 0.05)
    (1 -0.012756364284264488 0.05)
    (0.21396737878942007 -0.012756364284264488 0.05)
    (0 -0.015970302332697184 0.05)
    (0.2101371565738252 -0.015970302332697184 0.05)
    (0 -0.05 0.05)
    (0.2101371565738252 -0.05 0.05)
    (1 -0.015970302332697184 0.05)
    (1 -0.05 -0.05)
    (0 0.012756364284264488 -0.05)
    (0.18603262121057995 0.012756364284264488 -0.05)
    (0.18986284342617482 0.015970302332697184 -0.05)
    (0 0.015970302332697184 -0.05)
    (0 0.05 -0.05)
    (0.18986284342617482 0.05 -0.05)
    (1 0.05 -0.05)
    (1 0.015970302332697184 -0.05)
    (1 -0.012756364284264488 -0.05)
    (0.21396737878942007 -0.012756364284264488 -0.05)
    (0 -0.015970302332697184 -0.05)
    (0.2101371565738252 -0.015970302332697184 -0.05)
    (0 -0.05 -0.05)
    (0.2101371565738252 -0.05 -0.05)
    (1 -0.015970302332697184 -0.05)
);

blocks
(
    hex (17 18 19 20 1 2 3 4) (75 3 1) simpleGrading (0.3333333333333333 1 1)
    hex (20 19 22 21 4 3 6 5) (75 27 1) simpleGrading (0.3333333333333333 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex (19 24 23 22 3 8 7 6) (324 27 1) simpleGrading (3.0 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex (26 25 24 19 10 9 8 3) (324 34 1) simpleGrading (3.0 1 1)
    hex (27 28 18 17 11 12 2 1) (75 34 1) simpleGrading (0.3333333333333333 1 1)
    hex (29 30 28 27 13 14 12 11) (75 27 1) simpleGrading (0.3333333333333333 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex  (30 16 31 28 14 0 15 12) (324 27 1) simpleGrading (3.0 ( (0.5 0.5 3.0) (0.5 0.5 0.3333333333333333) ) 1)
    hex (28 31 25 26 12 15 9 10) (324 3 1) simpleGrading (3.0 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (20 4 5 21)
            (17 1 4 20)
            (27 11 1 17)
            (29 13 11 27)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 8 24 23)
            (8 9 25 24)
            (9 15 31 25)
            (15 0 16 31)
        );
    }
    y_top
    {
        type wall;
        faces
        (
            (21 5 6 22)
            (22 6 7 23)
        );
    }
    y_bot
    {
        type wall;
        faces
        (
            (13 29 30 14)
            (14 30 16 0)
        );
    }
    z_top
    {
        type wall;
        faces
        (
            (5 4 3 6)
            (4 1 2 3)
            (1 11 12 2)
            (11 13 14 12)
            (6 3 8 7)
            (3 10 9 8)
            (10 12 15 9)
            (12 14 0 15)
        );
    }
    z_bot
    {
        type wall;
        faces
        (
            (29 27 28 30)
            (27 17 18 28)
            (17 20 19 18)
            (20 21 22 19)
            (30 28 31 16)
            (28 26 25 31)
            (26 19 24 25)
            (19 22 23 24)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (3 19 26 10)
            (10 26 28 12)
            (18 2 12 28)
            (19 3 2 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
